; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-5-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city16)
	(fuel-level plane1 fl1)
	(at plane2 city4)
	(fuel-level plane2 fl6)
	(at plane3 city7)
	(fuel-level plane3 fl6)
	(at plane4 city3)
	(fuel-level plane4 fl4)
	(at plane5 city15)
	(fuel-level plane5 fl4)
	(at person1 city3)
	(at person2 city14)
	(at person3 city2)
	(at person4 city5)
	(at person5 city0)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane4 city11)
	(at person1 city20)
	(at person2 city4)
	(at person3 city5)
	(at person5 city16)
	))

)

; plan
1. (fly plane5 city15 city0 fl4 fl3)
   deleted: (at plane5 city15) (fuel-level plane5 fl4)
   added: (at plane5 city0) (fuel-level plane5 fl3)
   goals met: 0 of 5
2. (board person5 plane5 city0)
   deleted: (at person5 city0)
   added: (in person5 plane5)
   goals met: 0 of 5
3. (zoom plane5 city0 city16 fl3 fl2 fl1)
   deleted: (at plane5 city0) (fuel-level plane5 fl3)
   added: (at plane5 city16) (fuel-level plane5 fl1)
   goals met: 0 of 5
4. (debark person5 plane5 city16)
   deleted: (in person5 plane5)
   added: (at person5 city16)
   goals met: 1 of 5
5. (board person1 plane4 city3)
   deleted: (at person1 city3)
   added: (in person1 plane4)
   goals met: 1 of 5
6. (zoom plane4 city3 city11 fl4 fl3 fl2)
   deleted: (at plane4 city3) (fuel-level plane4 fl4)
   added: (at plane4 city11) (fuel-level plane4 fl2)
   goals met: 2 of 5
7. (fly plane1 city16 city14 fl1 fl0)
   deleted: (at plane1 city16) (fuel-level plane1 fl1)
   added: (at plane1 city14) (fuel-level plane1 fl0)
   goals met: 2 of 5
8. (zoom plane2 city4 city2 fl6 fl5 fl4)
   deleted: (at plane2 city4) (fuel-level plane2 fl6)
   added: (at plane2 city2) (fuel-level plane2 fl4)
   goals met: 2 of 5
9. (board person3 plane2 city2)
   deleted: (at person3 city2)
   added: (in person3 plane2)
   goals met: 2 of 5
10. (zoom plane2 city2 city5 fl4 fl3 fl2)
   deleted: (at plane2 city2) (fuel-level plane2 fl4)
   added: (at plane2 city5) (fuel-level plane2 fl2)
   goals met: 2 of 5
11. (debark person3 plane2 city5)
   deleted: (in person3 plane2)
   added: (at person3 city5)
   goals met: 3 of 5
12. (zoom plane2 city5 city14 fl2 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl2)
   added: (at plane2 city14) (fuel-level plane2 fl0)
   goals met: 3 of 5
13. (zoom plane3 city7 city14 fl6 fl5 fl4)
   deleted: (at plane3 city7) (fuel-level plane3 fl6)
   added: (at plane3 city14) (fuel-level plane3 fl4)
   goals met: 3 of 5
14. (board person2 plane3 city14)
   deleted: (at person2 city14)
   added: (in person2 plane3)
   goals met: 3 of 5
15. (zoom plane3 city14 city4 fl4 fl3 fl2)
   deleted: (at plane3 city14) (fuel-level plane3 fl4)
   added: (at plane3 city4) (fuel-level plane3 fl2)
   goals met: 3 of 5
16. (debark person2 plane3 city4)
   deleted: (in person2 plane3)
   added: (at person2 city4)
   goals met: 4 of 5
17. (zoom plane4 city11 city20 fl2 fl1 fl0)
   deleted: (at plane4 city11) (fuel-level plane4 fl2)
   added: (at plane4 city20) (fuel-level plane4 fl0)
   goals met: 3 of 5
18. (refuel plane4 city20 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 3 of 5
19. (debark person1 plane4 city20)
   deleted: (in person1 plane4)
   added: (at person1 city20)
   goals met: 4 of 5
20. (fly plane4 city20 city11 fl1 fl0)
   deleted: (at plane4 city20) (fuel-level plane4 fl1)
   added: (at plane4 city11) (fuel-level plane4 fl0)
   goals met: 5 of 5
